Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS00/atdf/PIC32CM2532LS00100.atdf
    <module name="OSCCTRL" id="U2119" version="5.0.0" caption="Oscillators Control">
      <register-group name="OSCCTRL" caption="Oscillators Control">
        <register name="EVCTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="CFDEO" caption="Clock Failure Detector Event Output Enable" mask="0x1"/>
          <bitfield name="TUNEEI" caption="Tune Event Input Enable" mask="0x2"/>
          <bitfield name="TUNEINV" caption="Tune Event Input Invert" mask="0x4"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector Interrupt Enable" mask="0x2"/>
          <bitfield name="OSC16MRDY" caption="OSC16M Ready Interrupt Enable" mask="0x10"/>
          <bitfield name="DFLLULPRDY" caption="DFLLULP Ready interrupt Enable" mask="0x100"/>
          <bitfield name="DFLLULPLOCK" caption="DFLLULP Lock Interrupt Enable" mask="0x200"/>
          <bitfield name="DFLLULPNOLOCK" caption="DFLLULP No Lock Interrupt Enable" mask="0x400"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise Interrupt Enable" mask="0x10000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall Interrupt Enable" mask="0x20000"/>
          <bitfield name="DPLLLTO" caption="DPLL Lock Timeout Interrupt Enable" mask="0x40000"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Loop Divider Ratio Update Complete Interrupt Enable" mask="0x80000"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready Interrupt Enable" mask="0x1000000"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds Interrupt Enable" mask="0x2000000"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine Interrupt Enable" mask="0x4000000"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse Interrupt Enable" mask="0x8000000"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped Interrupt Enable" mask="0x10000000"/>
        </register>
        <register name="INTENSET" offset="0x8" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector Interrupt Enable" mask="0x2"/>
          <bitfield name="OSC16MRDY" caption="OSC16M Ready Interrupt Enable" mask="0x10"/>
          <bitfield name="DFLLULPRDY" caption="DFLLULP Ready interrupt Enable" mask="0x100"/>
          <bitfield name="DFLLULPLOCK" caption="DFLLULP Lock Interrupt Enable" mask="0x200"/>
          <bitfield name="DFLLULPNOLOCK" caption="DFLLULP No Lock Interrupt Enable" mask="0x400"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise Interrupt Enable" mask="0x10000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall Interrupt Enable" mask="0x20000"/>
          <bitfield name="DPLLLTO" caption="DPLL Lock Timeout Interrupt Enable" mask="0x40000"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Loop Divider Ratio Update Complete Interrupt Enable" mask="0x80000"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready Interrupt Enable" mask="0x1000000"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds Interrupt Enable" mask="0x2000000"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine Interrupt Enable" mask="0x4000000"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse Interrupt Enable" mask="0x8000000"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped Interrupt Enable" mask="0x10000000"/>
        </register>
        <register name="INTFLAG" offset="0xC" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector" mask="0x2"/>
          <bitfield name="OSC16MRDY" caption="OSC16M Ready" mask="0x10"/>
          <bitfield name="DFLLULPRDY" caption="DFLLULP Ready" mask="0x100"/>
          <bitfield name="DFLLULPLOCK" caption="DFLLULP Lock" mask="0x200"/>
          <bitfield name="DFLLULPNOLOCK" caption="DFLLULP No Lock" mask="0x400"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x10000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x20000"/>
          <bitfield name="DPLLLTO" caption="DPLL Lock Timeout" mask="0x40000"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Loop Divider Ratio Update Complete" mask="0x80000"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready Interrupt Enable" mask="0x1000000"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds Interrupt Enable" mask="0x2000000"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine Interrupt Enable" mask="0x4000000"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse Interrupt Enable" mask="0x8000000"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped Interrupt Enable" mask="0x10000000"/>
        </register>
        <register name="STATUS" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Status">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector" mask="0x2"/>
          <bitfield name="XOSCCKSW" caption="XOSC Clock Switch" mask="0x4"/>
          <bitfield name="OSC16MRDY" caption="OSC16M Ready" mask="0x10"/>
          <bitfield name="DFLLULPRDY" caption="DFLLULP Ready" mask="0x100"/>
          <bitfield name="DFLLULPLOCK" caption="DFLLULP Lock" mask="0x200"/>
          <bitfield name="DFLLULPNOLOCK" caption="DFLLULP No Lock" mask="0x400"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x10000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x20000"/>
          <bitfield name="DPLLLTO" caption="DPLL Lock Timeout" mask="0x40000"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Loop Divider Ratio Update Complete" mask="0x80000"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x1000000"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x2000000"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x4000000"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x8000000"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x10000000"/>
        </register>
        <register name="XOSCCTRL" offset="0x14" rw="RW" size="2" initval="0x0080" caption="External Multipurpose Crystal Oscillator (XOSC) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="CFDEN" caption="Clock Failure Detector Enable" mask="0x8"/>
          <bitfield name="SWBEN" caption="Clock Switch Back Enable" mask="0x10"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="GAIN" caption="Oscillator Gain" mask="0x700" values="OSCCTRL_XOSCCTRL__GAIN"/>
          <bitfield name="AMPGC" caption="Automatic Amplitude Gain Control" mask="0x800"/>
          <bitfield name="STARTUP" caption="Start-Up Time" mask="0xF000" values="OSCCTRL_XOSCCTRL__STARTUP"/>
        </register>
        <register name="CFDPRESC" offset="0x16" rw="RW" size="1" initval="0x00" caption="Clock Failure Detector Prescaler">
          <bitfield name="CFDPRESC" caption="Clock Failure Detector Prescaler" mask="0x7" values="OSCCTRL_CFDPRESC__CFDPRESC"/>
        </register>
        <register name="OSC16MCTRL" offset="0x18" rw="RW" size="1" initval="0x82" caption="16MHz Internal Oscillator (OSC16M) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="FSEL" caption="Oscillator Frequency Selection" mask="0xC" values="OSCCTRL_OSC16MCTRL__FSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
        </register>
        <register name="DFLLULPCTRL" offset="0x1C" rw="RW" access="WSYNC" size="2" initval="0x0504" caption="DFLLULP Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="BINSE" caption="Binary Search Enable" mask="0x8"/>
          <bitfield name="SAFE" caption="Tuner Safe Mode" mask="0x10"/>
          <bitfield name="DITHER" caption="Tuner Dither Mode" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand" mask="0x80"/>
          <bitfield name="DIV" caption="Division Factor" mask="0x700" values="OSCCTRL_DFLLULPCTRL__DIV"/>
        </register>
        <register name="DFLLULPDITHER" offset="0x1E" rw="RW" size="1" initval="0x00" caption="DFLLULP Dither Control">
          <bitfield name="STEP" caption="Dither Step" mask="0x7" values="OSCCTRL_DFLLULPDITHER__STEP"/>
          <bitfield name="PER" caption="Dither Period" mask="0x70" values="OSCCTRL_DFLLULPDITHER__PER"/>
        </register>
        <register name="DFLLULPRREQ" offset="0x1F" rw="RW" size="1" initval="0x00" caption="DFLLULP Read Request">
          <bitfield name="RREQ" caption="Read Request" mask="0x80"/>
        </register>
        <register name="DFLLULPDLY" offset="0x20" rw="RW" access="WSYNC" size="4" initval="0x00000080" caption="DFLLULP Delay Value">
          <bitfield name="DELAY" caption="Delay Value" mask="0xFF"/>
        </register>
        <register name="DFLLULPRATIO" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="DFLLULP Target Ratio">
          <bitfield name="RATIO" caption="Target Tuner Ratio" mask="0x7FF"/>
        </register>
        <register name="DFLLULPSYNCBUSY" offset="0x28" rw="R" size="4" initval="0x00000000" caption="DFLLULP Synchronization Busy">
          <bitfield name="ENABLE" caption="Enable Bit Synchronization Busy" mask="0x2"/>
          <bitfield name="DELAY" caption="Delay Register Synchronization Busy" mask="0x8"/>
        </register>
        <register name="DFLLCTRL" offset="0x30" rw="RW" access="WSYNC" size="2" initval="0x0080" caption="DFLL48M Control">
          <bitfield name="ENABLE" caption="DFLL Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode Selection" mask="0x4"/>
          <bitfield name="STABLE" caption="Stable DFLL Frequency" mask="0x8"/>
          <bitfield name="LLAW" caption="Lose Lock After Wake" mask="0x10"/>
          <bitfield name="USBCRM" caption="USB Clock Recovery Mode" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="CCDIS" caption="Chill Cycle Disable" mask="0x100"/>
          <bitfield name="QLDIS" caption="Quick Lock Disable" mask="0x200"/>
          <bitfield name="BPLCKC" caption="Bypass Coarse Lock" mask="0x400"/>
          <bitfield name="WAITLOCK" caption="Wait Lock" mask="0x800"/>
        </register>
        <register name="DFLLVAL" offset="0x34" rw="RW" access="RWSYNC" size="4" initval="0x00000000" caption="DFLL48M Value">
          <bitfield name="FINE" caption="Fine Value" mask="0x3FF"/>
          <bitfield name="COARSE" caption="Coarse Value" mask="0xFC00"/>
          <bitfield name="DIFF" caption="Multiplication Ratio Difference" mask="0xFFFF0000"/>
        </register>
        <register name="DFLLMUL" offset="0x38" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="DFLL48M Multiplier">
          <bitfield name="MUL" caption="DFLL Multiply Factor" mask="0xFFFF"/>
          <bitfield name="FSTEP" caption="Fine Maximum Step" mask="0x3FF0000"/>
          <bitfield name="CSTEP" caption="Coarse Maximum Step" mask="0xFC000000"/>
        </register>
        <register name="DFLLSYNC" offset="0x3C" rw="RW" size="1" initval="0x00" caption="DFLL48M Synchronization">
          <bitfield name="READREQ" caption="Read Request" mask="0x80"/>
        </register>
        <register name="DPLLCTRLA" offset="0x40" rw="RW" access="WSYNC" size="1" initval="0x80" caption="DPLL Control A">
          <bitfield name="ENABLE" caption="DPLL Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Clock Activation" mask="0x80"/>
        </register>
        <register name="DPLLRATIO" offset="0x44" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="DPLL Ratio Control">
          <bitfield name="LDR" caption="Loop Divider Ratio" mask="0xFFF"/>
          <bitfield name="LDRFRAC" caption="Loop Divider Ratio Fractional Part" mask="0xF0000"/>
        </register>
        <register name="DPLLCTRLB" offset="0x48" rw="RW" size="4" initval="0x00000000" caption="DPLL Control B">
          <bitfield name="FILTER" caption="Proportional Integral Filter Selection" mask="0x3" values="OSCCTRL_DPLLCTRLB__FILTER"/>
          <bitfield name="LPEN" caption="Low-Power Enable" mask="0x4"/>
          <bitfield name="WUF" caption="Wake Up Fast" mask="0x8"/>
          <bitfield name="REFCLK" caption="Reference Clock Selection" mask="0x30" values="OSCCTRL_DPLLCTRLB__REFCLK"/>
          <bitfield name="LTIME" caption="Lock Time" mask="0x700" values="OSCCTRL_DPLLCTRLB__LTIME"/>
          <bitfield name="LBYPASS" caption="Lock Bypass" mask="0x1000"/>
          <bitfield name="DIV" caption="Clock Divider" mask="0x7FF0000"/>
        </register>
        <register name="DPLLPRESC" offset="0x4C" rw="RW" access="WSYNC" size="1" initval="0x00" caption="DPLL Prescaler">
          <bitfield name="PRESC" caption="Output Clock Prescaler" mask="0x3" values="OSCCTRL_DPLLPRESC__PRESC"/>
        </register>
