Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS00/atdf/PIC32CM2532LS00100.atdf
        <register name="DPLLSYNCBUSY" offset="0x50" rw="R" size="1" initval="0x00" caption="DPLL Synchronization Busy">
          <bitfield name="ENABLE" caption="DPLL Enable Synchronization Status" mask="0x2"/>
          <bitfield name="DPLLRATIO" caption="DPLL Loop Divider Ratio Synchronization Status" mask="0x4"/>
          <bitfield name="DPLLPRESC" caption="DPLL Prescaler Synchronization Status" mask="0x8"/>
        </register>
        <register name="DPLLSTATUS" offset="0x54" rw="R" size="1" initval="0x00" caption="DPLL Status">
          <bitfield name="LOCK" caption="DPLL Lock" mask="0x1"/>
          <bitfield name="CLKRDY" caption="DPLL Clock Ready" mask="0x2"/>
        </register>
      </register-group>
      <value-group name="OSCCTRL_XOSCCTRL__GAIN">
        <value name="GAIN2" caption="2MHz max" value="0x0"/>
        <value name="GAIN4" caption="4MHz max" value="0x1"/>
        <value name="GAIN8" caption="8MHz max" value="0x2"/>
        <value name="GAIN16" caption="16MHz max" value="0x3"/>
        <value name="GAIN30" caption="30MHz max" value="0x4"/>
      </value-group>
      <value-group name="OSCCTRL_XOSCCTRL__STARTUP">
        <value name="CYCLE1" caption="1 cycle" value="0x0"/>
        <value name="CYCLE2" caption="2 cycles" value="0x1"/>
        <value name="CYCLE4" caption="4 cycles" value="0x2"/>
        <value name="CYCLE8" caption="8 cycles" value="0x3"/>
        <value name="CYCLE16" caption="16 cycles" value="0x4"/>
        <value name="CYCLE32" caption="32 cycles" value="0x5"/>
        <value name="CYCLE64" caption="64 cycles" value="0x6"/>
        <value name="CYCLE128" caption="128 cycles" value="0x7"/>
        <value name="CYCLE256" caption="256 cycles" value="0x8"/>
        <value name="CYCLE512" caption="512 cycles" value="0x9"/>
        <value name="CYCLE1024" caption="1024 cycles" value="0xA"/>
        <value name="CYCLE2048" caption="2048 cycles" value="0xB"/>
        <value name="CYCLE4096" caption="4096 cycles" value="0xC"/>
        <value name="CYCLE8192" caption="8192 cycles" value="0xD"/>
        <value name="CYCLE16384" caption="16384 cycles" value="0xE"/>
        <value name="CYCLE32768" caption="32768 cycles" value="0xF"/>
      </value-group>
      <value-group name="OSCCTRL_CFDPRESC__CFDPRESC">
        <value name="DIV1" caption="OSC16M/1" value="0"/>
        <value name="DIV2" caption="OSC16M/2" value="1"/>
        <value name="DIV4" caption="OSC16M/4" value="2"/>
        <value name="DIV8" caption="OSC16M/8" value="3"/>
        <value name="DIV16" caption="OSC16M/16" value="4"/>
        <value name="DIV32" caption="OSC16M/32" value="5"/>
        <value name="DIV64" caption="OSC16M/64" value="6"/>
        <value name="DIV128" caption="OSC16M/128" value="7"/>
      </value-group>
      <value-group name="OSCCTRL_OSC16MCTRL__FSEL">
        <value name="4MHZ" caption="4MHz" value="0x0"/>
        <value name="8MHZ" caption="8MHz" value="0x1"/>
        <value name="12MHZ" caption="12MHz" value="0x2"/>
        <value name="16MHZ" caption="16MHz" value="0x3"/>
      </value-group>
      <value-group name="OSCCTRL_DFLLULPCTRL__DIV">
        <value name="DIV1" caption="Frequency Divided by 1" value="0x0"/>
        <value name="DIV2" caption="Frequency Divided by 2" value="0x1"/>
        <value name="DIV4" caption="Frequency Divided by 4" value="0x2"/>
        <value name="DIV8" caption="Frequency Divided by 8" value="0x3"/>
        <value name="DIV16" caption="Frequency Divided by 16" value="0x4"/>
        <value name="DIV32" caption="Frequency Divided by 32" value="0x5"/>
      </value-group>
      <value-group name="OSCCTRL_DFLLULPDITHER__PER">
        <value name="PER1" caption="Dither Over 1 Reference Clock Period" value="0x0"/>
        <value name="PER2" caption="Dither Over 2 Reference Clock Period" value="0x1"/>
        <value name="PER4" caption="Dither Over 4 Reference Clock Period" value="0x2"/>
        <value name="PER8" caption="Dither Over 8 Reference Clock Period" value="0x3"/>
        <value name="PER16" caption="Dither Over 16 Reference Clock Period" value="0x4"/>
        <value name="PER32" caption="Dither Over 32 Reference Clock Period" value="0x5"/>
      </value-group>
      <value-group name="OSCCTRL_DFLLULPDITHER__STEP">
        <value name="STEP1" caption="Dither Step = 1" value="0x0"/>
        <value name="STEP2" caption="Dither Step = 2" value="0x1"/>
        <value name="STEP4" caption="Dither Step = 4" value="0x2"/>
        <value name="STEP8" caption="Dither Step = 8" value="0x3"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__FILTER">
        <value name="DEFAULT" caption="Default Filter Mode" value="0"/>
        <value name="LBFILT" caption="Low Bandwidth Filter" value="1"/>
        <value name="HBFILT" caption="High Bandwidth Filter" value="2"/>
        <value name="HDFILT" caption="High Damping Filter" value="3"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__LTIME">
        <value name="Default" caption="No time-out. Automatic lock" value="0"/>
        <value name="8MS" caption="Time-out if no lock within 8 ms" value="4"/>
        <value name="9MS" caption="Time-out if no lock within 9 ms" value="5"/>
        <value name="10MS" caption="Time-out if no lock within 10 ms" value="6"/>
        <value name="11MS" caption="Time-out if no lock within 11 ms" value="7"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__REFCLK">
        <value name="XOSC32K" caption="XOSC32K Clock Reference" value="0"/>
        <value name="XOSC" caption="XOSC Clock Reference" value="1"/>
        <value name="GCLK" caption="GCLK Clock Reference" value="2"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLPRESC__PRESC">
        <value name="DIV1" caption="DPLL output is divided by 1" value="0"/>
        <value name="DIV2" caption="DPLL output is divided by 2" value="1"/>
        <value name="DIV4" caption="DPLL output is divided by 4" value="2"/>
      </value-group>
    </module>
    <module name="PAC" id="U2120" version="2.0.0" caption="Peripheral Access Controller">
      <register-group name="PAC" caption="Peripheral Access Controller">
        <register name="WRCTRL" offset="0x0" rw="RW" size="4" initval="0x00020021" caption="Write control">
          <bitfield name="PERID" caption="Peripheral identifier" mask="0xFFFF"/>
          <bitfield name="KEY" caption="Peripheral access control key" mask="0xFF0000" values="PAC_WRCTRL__KEY"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Event control">
          <bitfield name="ERREO" caption="Peripheral acess error event output" mask="0x1"/>
        </register>
